# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeomCombinationSet..::..ReverseIterator Method
GeomCombinationSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual GeomCombinationSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As GeomCombinationSetIterator
```

Visual C++
---
```text
public:
virtual GeomCombinationSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
GeomCombinationSet Class
Autodesk.Revit.DB Namespace